# Assignment1_Qingzhu_12138

# 课堂练习1

## 如何将3.141592657 转换成character
as.character(3.1415926)

## 如何将3.141592657 转换成logical
as.logical(3.141592657)

## 如何判断"hello world"是否是一个character
is.character("hello world")

## 如何判断一个NA是否是缺失值
is.na(NA)

# 课堂练习2
v1 <- c(1,2,3,4)

## 取出v1的第2和第3个元素
v1[c(F,T,T,F)] 

## 取出v1的最后一个元素
v1[c(F,F,F,T)] 

## 取出v1中整除3的元素
v1[v1 %% 3 ==0 ]

## v1[-1]会返回什么结果,有何启示?
v1[-2]
###-1返回了234，尝试了-2，-3，-4，发现“-几”就不取出“第几个元素”

## v1[5]会返回什么结果,有何启示?
v1[5]
###返回NA，无法取出不存在的元素

## v1[] <- 99 与 v1 <- 99 有何不同?
v1[] <- 99
v1

v1 <- c(1,2,3,4)
v1 <- 99 
v1
###前者赋值向量/矩阵内的每个元素，后者将改变数据类型为一个数值

##END